# 1. Create the following pandas dataframe with marks for Ajay, Manan, Usha and Vijay each column representing marks in Biology, Physics, Chemistry, Math and English.

In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
mks = np.array([85,67,78,99,78,94,69,77,89,67,93,90,89,90,56,90,78,60,78,77])

In [4]:
marks = pd.DataFrame(mks.reshape(4,5),index='Ajay Manan Usha Vijay'.split(),columns='Bio. Phy. Chem. Math Eng.'.split())

In [5]:
marks

       Bio.  Phy.  Chem.  Math  Eng.
Ajay     85    67     78    99    78
Manan    94    69     77    89    67
Usha     93    90     89    90    56
Vijay    90    78     60    78    77

# 2. Pick up details of each student individually

In [6]:
marks.iloc[0]

Bio.     85
Phy.     67
Chem.    78
Math     99
Eng.     78
Name: Ajay, dtype: int32

In [7]:
marks.iloc[1]

Bio.     94
Phy.     69
Chem.    77
Math     89
Eng.     67
Name: Manan, dtype: int32

In [8]:
marks.iloc[2]

Bio.     93
Phy.     90
Chem.    89
Math     90
Eng.     56
Name: Usha, dtype: int32

In [9]:
marks.iloc[3]

Bio.     90
Phy.     78
Chem.    60
Math     78
Eng.     77
Name: Vijay, dtype: int32

# 3. Pick up the details of students whose marks in Physics are more than 70.

In [10]:
marks[marks['Phy.']>70]

       Bio.  Phy.  Chem.  Math  Eng.
Usha     93    90     89    90    56
Vijay    90    78     60    78    77

# 4. Pick up the Math and English marks of students whose marks in Physics are more than 70.

In [11]:
marks[marks['Phy.']>70][['Math','Eng.']]

       Math  Eng.
Usha     90    56
Vijay    78    77

# 5. Pick up the details of students whose marks in Physics are more than 70 and marks in Chemistry are more than 80.

In [12]:
marks[(marks['Phy.']>70) & (marks['Chem.']>80)]

      Bio.  Phy.  Chem.  Math  Eng.
Usha    93    90     89    90    56